#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/julgonza-organization/julgonza-workspace/runs/run-DosxBLryYWbK3mp3

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
aws_subnet.private-subnets[0]: Refreshing state... [id=subnet-0d6d24f4052ad8c1b]
aws_vpc.lab-vpc: Refreshing state... [id=vpc-062739d2a03280afe]
aws_route_table_association.private_rta[0]: Refreshing state... [id=rtbassoc-0578daf44077788e2]
aws_nat_gateway.labnatgw: Refreshing state... [id=nat-007f3fdf1b63b7c5f]
aws_internet_gateway.labigw: Refreshing state... [id=igw-09cd1c4f85c436f3e]
aws_route_table_association.private_rta[1]: Refreshing state... [id=rtbassoc-092c62e907e0428e9]
aws_subnet.public-subnet: Refreshing state... [id=subnet-0f9baa27e4a8b78ba]
aws_eip.static_ip: Refreshing state... [id=eipalloc-08672c005b1bbb5a1]
aws_route_table.public_rt: Refreshing state... [id=rtb-0113d753baf9693cc]
aws_route_table.private_rt: Refreshing state... [id=rtb-0c00f304cb7c58d11]
aws_route_table_association.public_rta: Refreshing state... [id=rtbassoc-07b842fbf126aec58]
aws_subnet.private-subnets[1]: Refreshing state... [id=subnet-06ed7b4623c0cdcf1]
data.aws_ami.ubuntu: Refreshing...
data.aws_ami.ubuntu: Refresh complete after 1s [id=ami-0c65adc9a5c1b5d7c]
aws_nat_gateway.labnatgw: Drift detected (delete)
aws_vpc.lab-vpc: Drift detected (delete)
aws_internet_gateway.labigw: Drift detected (delete)
aws_route_table.private_rt: Drift detected (delete)
aws_route_table_association.private_rta[0]: Drift detected (delete)
aws_route_table_association.private_rta[1]: Drift detected (delete)
aws_subnet.private-subnets[1]: Drift detected (delete)
aws_subnet.private-subnets[0]: Drift detected (delete)
aws_route_table.public_rt: Drift detected (delete)
aws_eip.static_ip: Drift detected (delete)
aws_route_table_association.public_rta: Drift detected (delete)
aws_subnet.public-subnet: Drift detected (delete)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "az_count" but a value
│ was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-DosxBLryYWbK3mp3/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "region" but a value was
│ found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-DosxBLryYWbK3mp3/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                                  = "ami-0c65adc9a5c1b5d7c"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = "d36263b945850b1251dc22e4ed5c62aeb9e9e0f0"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_security_group.web-sg will be created
  + resource "aws_security_group" "web-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # random_pet.sg will be created
  + resource "random_pet" "sg" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + web-address = (known after apply)

------------------------------------------------------------------------

Cost Estimation:

Resources: 1 of 1 estimated
           $8.6304/mo +$8.6304

```

</details>

*Pushed by: @julgonzaibm, Action: `pull_request`*